Reports/бит_ВоинскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ВоинскийУчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/бит_ВоинскийУчет/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Дата        = ТекущаяДата();
	
	Отчет.Организация = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура формирования отчета.
//
// Параметры:
//  Параметр1 – Строка.
//
&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Результат.Очистить();
	
	СтруктураНастроек = Отчеты.бит_ВоинскийУчет.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛицевойСчет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ФизЛицо");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДатаРождения");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СтатусПроживания");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Фамилия");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Имя");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Отчество");
	СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЛет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Гражданство");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументВид");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументСерия");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументНомер");
	СтруктураНастроек.ОбязательныеПоля.Добавить("АдресПрописки");
	СтруктураНастроек.ОбязательныеПоля.Добавить("АдресФактический");
	СтруктураНастроек.ОбязательныеПоля.Добавить("КонтактныйТелефон");
	СтруктураНастроек.ОбязательныеПоля.Добавить("МестоРаботы");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Должность");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ОтметкаВоенногоКомиссариата");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Период"     , КонецДня(Отчет.Дата));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Отчет.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ЗапросПоПроживающим";
	
	СтруктураРезультата = Отчеты.бит_ВоинскийУчет.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	Макет = Отчеты.бит_ВоинскийУчет.ПолучитьМакет("Список");
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Отчет.Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&Период, ГОД, -17) КАК Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ОбластьШапка.Параметры.ГодРождения         = Формат(Выборка.Период, "ДФ=yyyy") ;
	ОбластьШапка.Параметры.ГодПостановкиНаУчет = Формат(Отчет.Дата, "ДФ=yy") ;
	
	Результат.Вывести(ОбластьШапка);
	Выборка = СтруктураРезультата.РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомерСтроки = 1;
	
	ТаблицаФизЛицСтаршеСемнадцати = Новый ТаблицаЗначений;
	ТаблицаФизЛицСтаршеСемнадцати.Колонки.Добавить("ФИО");
	ТаблицаФизЛицСтаршеСемнадцати.Колонки.Добавить("Гражданство");
	ТаблицаФизЛицСтаршеСемнадцати.Колонки.Добавить("МестоРаботыИДольжность");
	ТаблицаФизЛицСтаршеСемнадцати.Колонки.Добавить("Адрес");
	
	Пока Выборка.Следующий() Цикл
		
		ФИО                   = Строка(Выборка.Фамилия) + " " + Строка(Выборка.Имя) + " " + Строка(Выборка.Отчество);
		Адрес                 = Строка(Выборка.АдресПрописки) + ", " + Строка(Выборка.АдресФактический) + ", " + Строка(Выборка.КонтактныйТелефон);
		МестоРаботыИДолжность = Строка(Выборка.МестоРаботы) + ", " + Строка(Выборка.Должность);
		Гражданство           = Строка(Выборка.Гражданство) + ", " + Строка(Выборка.ДокументСерия) + ", " + Строка(Выборка.ДокументНомер);
		
		Если Выборка.КоличествоЛет < 17 Тогда
			
			НоваяСтрока = ТаблицаФизЛицСтаршеСемнадцати.Добавить();
			НоваяСтрока.ФИО                   = ФИО + ", " + Выборка.ДатаРождения;
			НоваяСтрока.Адрес                 = Адрес;
			НоваяСтрока.МестоРаботыИДолжность = МестоРаботыИДолжность;
			НоваяСтрока.Гражданство           = Гражданство;
			
			Продолжить;
			
		КонецЕсли; 
		
		ОбластьСтрока.Параметры.НомерСтроки                 = НомерСтроки;
		ОбластьСтрока.Параметры.ФИО                         = ФИО;
		ОбластьСтрока.Параметры.Гражданство                 = Гражданство;
		ОбластьСтрока.Параметры.МестоРаботыИДольжность      = МестоРаботыИДолжность;
		ОбластьСтрока.Параметры.Адрес                       = Адрес;
		
		Результат.Вывести(ОбластьСтрока);
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из ТаблицаФизЛицСтаршеСемнадцати Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтрока.Параметры.НомерСтроки                 = НомерСтроки;
		ОбластьСтрока.Параметры.ФИО                         = ФИО;
		ОбластьСтрока.Параметры.Гражданство                 = Гражданство;
		ОбластьСтрока.Параметры.МестоРаботыИДольжность      = МестоРаботыИДолжность;
		ОбластьСтрока.Параметры.Адрес                       = Адрес;
		
		Результат.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры // ()  

// Процедура выполняет загрузку настроек отбора из настроек по умолчанию.
//
&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
	
	СхемаКомпоновкиДанных = Отчеты.бит_ВоинскийУчет.ПолучитьМакет("ЗапросПоПроживающим");
	КомпоновщикНастроек.Инициализировать(
	Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры // ЗагрузитьНастройкиОтбораПоУмолчанию()

#КонецОбласти
